app/Controllers/Configuracion.php

    public function index()
    {
        $model = new UsuarioModel();
        $data['usuarios'] = $model->findAll();
---
SELECT *
FROM `usuarios`