app/Controllers/Login.php

    public function checkLogin()
    {

        $session = session();
        $model = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Buscar usuario
        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'anabrondino@alumnos.itr3.edu.ar'
 LIMIT 1