app/Controllers/MiPerfil.php

    public function miperfil()
    {
        // 🔒 PROTECCIÓN CORRECTA
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $model = new UsuarioModel();

        $usuario = $model->find(session()->get('id_usuario'));
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '13'