app/Controllers/RecuperarPassword.php

    public function enviar()
    {
        helper(['form']);

        $emailUsuario = $this->request->getPost('email');

        if (!$emailUsuario) {
            return redirect()->back()->with('error', 'Ingresá un email válido');
        }

        $model = new RecuperarContrasenaModel();
        $usuarioModel = new UsuarioModel();

        // 🔍 verificar usuario
        $usuario = $usuarioModel->where('email', $emailUsuario)->first();

        if (!$usuario) {
            return redirect()->back()->with('error', 'El email no está registrado');
        }

        $token = bin2hex(random_bytes(32));

        // 💾 guardar solicitud (IMPORTANTE)
        $model->insert([
            'email' => $emailUsuario,
            'token' => $token,
            'estado' => 'pendiente'
        ]);
---
SELECT *
FROM `usuarios`
WHERE `email` = 'celinamaldonado@alumnos.itr3.edu.ar'
 LIMIT 1
INSERT INTO `recuperar_contrasena` (`email`, `token`, `estado`) VALUES ('celinamaldonado@alumnos.itr3.edu.ar', '56b80ff878684acd7cf4be1b525a899572308358ae7cc7301056098d22f73585', 'pendiente')