app/Controllers/Registro.php

    public function store()
    {
        $model = new UsuarioModel();

        $nombre = $this->request->getPost('username');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $confirm = $this->request->getPost('confirm_password');

        // 1. Validar contraseñas iguales
        if ($password !== $confirm) {
            return redirect()->back()->with('error', 'Las contraseñas no coinciden');
        }

        // 2. Validar email duplicado
        $existe = $model->where('email', $email)->first();
        if ($existe) {
            return redirect()->back()->with('error', 'El email ya está registrado');
        }

        // 3. Guardar usuario seguro
        $data = [
            'nombre' => $nombre,
            'email' => $email,
            'password' => password_hash($password, PASSWORD_DEFAULT),
            'rol' => 'usuario'
        ];

        $model->insert($data);
---
SELECT *
FROM `usuarios`
WHERE `email` = 'celinamaldonado@alumnos.itr3.edu.ar'
 LIMIT 1
INSERT INTO `usuarios` (`nombre`, `email`, `password`, `rol`) VALUES ('celina', 'celinamaldonado@alumnos.itr3.edu.ar', '$2y$10$O5.uCzwuzJ.iFOduHjBgAOEnLtDTaq.jj6k4.qcyo1.ripMH6Gj4W', 'usuario')