app/Controllers/SolPass.php

    public function index()
    {
        if ($redir = $this->checkAdmin()) {
            return $redir;
        }

        $model = new RecuperarContrasenaModel();

        $data['solicitudes'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `recuperar_contrasena`
ORDER BY `id` DESC

    public function aprobar($id = null)
    {
        if ($redir = $this->checkAdmin()) {
            return $redir;
        }

        $model = new RecuperarContrasenaModel();
        $solicitud = $model->find($id);

        if (!$solicitud) {
            return redirect()->back()->with('error', 'Solicitud no encontrada');
        }

        $model->update($id, ['estado' => 'aprobado']);
---
SELECT *
FROM `recuperar_contrasena`
WHERE `recuperar_contrasena`.`id` = '23'
UPDATE `recuperar_contrasena` SET `estado` = 'aprobado'
WHERE `recuperar_contrasena`.`id` IN ('23')

   public function rechazar($id)
{
    if ($redir = $this->checkAdmin()) {
        return $redir;
    }

    $model = new \App\Models\RecuperarContrasenaModel();
    $solicitud = $model->find($id);

    if (!$solicitud) {
        return redirect()->back()->with('error', 'Solicitud no encontrada');
    }

    // 🔴 ESTADO CORRECTO (UNO SOLO)
    $model->update($id, ['estado' => 'rechazado']);
---
SELECT *
FROM `recuperar_contrasena`
WHERE `recuperar_contrasena`.`id` = '24'
UPDATE `recuperar_contrasena` SET `estado` = 'rechazada'
WHERE `recuperar_contrasena`.`id` IN ('24')