app/Controllers/VistaPrincipal.php

SELECT *
FROM `sensores`
---
    public function index()
    {
        $sensorModel = new SensorModel();

        $data['sensores'] = $sensorModel->findAll();